<template>
  <div>home page
test job_1
<div class="z">
  <ul>
    <li>---Соеденить проект с компом который на работе</li>
    <li>---Доделать сортировку по алфавиту в спраочниках сбоку и сортировку в поиске</li>
    <li>---Доделать адаптивность</li>
    <li>---доделать клик на мейн и шапку чтобы плавно уходил сайтбар при мобийл версии Возможно нужно будет
      взаимодействие с vuex как в job spa
    </li>
    <li>---Вынести справочники в vuex</li>
    <li>---Посмотреть как в проекте БИМ с роутами, если их много, как оптимизировать</li>
    <li>---Анимацию доделать</li>
    <li>Сделать архитектуру приложения нормальную и все поудалять лишнее</li>
  </ul>

    <ul>
      <li>Сделать анализ видео что кидал в вк и сделать список ссылками в SPA И Список с полезными каналами ютуб</li>
    <li>---Скачать или залить на яндекс диск курс по JS и делать конспект его</li>
    <li>---Скинуть на ноут и на работе проект БИМ и job SPA чтобы от туда брать шаблоны решений</li>
    <li>---Смотреть курс Vue+Vuex Udemy</li>
    <li>---</li>
    <li>---</li>
    <li>---</li>
    <li>---</li>
  </ul>

    <ul>
      <li style="color:red; font-weight:bold">работа -- сверстать блок бренды</li>
    <li>---Перекинуть все на SSD</li>
    <li>---Разобрать гитхабы все</li>
    <li>---Разобрать Портфолио и сделать одно нормальное</li>
    <li>---</li>
    <li>---</li>
    <li>---</li>
    <li>---</li>
  </ul>

</div>



1.Смотреть яндекс диск курс js и делать конспект+ мини проекты





      <h1>ПОДКЛЮЧИТЬ СТИЛИ ОТДЕЛЬНЫМ ФАЙЛОС ЦСС ИМПОРТ И РЕСЕТЫ</h1>

      <p>https://metanit.com/web/vuejs/8.2.php

https://www.youtube.com/watch?v=rqB7jRunukw

https://webdevkin.ru/posts/frontend/adminka-vue-8-vuex-practice

Димыч см ютуб калан реакл камасутра

http://falbar.ru/article/kak-ispolzovat-routing-v-vue-dlya-sozdaniya-xoroshego-polzovatelskogo-interfejsa

https://www.youtube.com/watch?v=Xd_rxScxRWs

.split(' ').join('-')
split осуществляет разбиение строки в массив по указанному разделителю.
 join объединяет элементы массива в строку с указанным разделителем (он будет вставлен между элементами массива</p>
  
  тз https://www.notion.so/Junior-Frontend-developer-aeeb4eac55634e11a855ae294fbe4404

  посмотреть bim проекты как выносить роуты на компоненты
  <!--Добавление нового файла или страницы   -->
  <!-- 1. пишем название (sort,json) в массив test в leftsidebar vue -->
  <!-- 2. создаем сам файл sort.vue в папке views в нужной папке категории и создаем разметку в нем -->
  <!-- 3. папка router => index.js => пишем в routers путь,имя и импортируем файл компонент (sort,json) -->
  
  научиться передавать события и общаться через компоненты между собой
  </div>
</template>

<script>
export default {

}
</script>

<style>
.z {
  display: flex;
  justify-content: space-around;
}
li {
  margin-bottom: 10px;
}
</style>