<template>
  <div>home page


Накидать план по программированию и цели
CВЯЗАТЬ РАБОЧИЙ КОМП С ПРИЛОЖЕНИЕМ

1.Смотреть яндекс диск курс js и делать конспект+ мини проекты


работа -- сверстать блок бренды

Сделать анализ видео и полезных ссылок и вынести их в приложение textbook
1. по книге соеденить с рабочим компом и делать
2. делать сортировку у сайдбара у справочников и при поиске сортировка по алфавиту
3. сделать чтобы при моб версии кликал на мейн и шапку и сайтбар плавно уходил в лево и при клике появлялся
4. сделать адаптив, анимацию
5. сделать шаблон для определений и кода 
6. посмотреть как соеденять роуты в проекте БИМ были
7 перекинуть БИМ на SSD


Разобрать гитхабы и портфолио




    test_ 1_1
    test_ 2_2
    test_3_3
      <h1>ПОДКЛЮЧИТЬ СТИЛИ ОТДЕЛЬНЫМ ФАЙЛОС ЦСС ИМПОРТ И РЕСЕТЫ</h1>

      <p>https://metanit.com/web/vuejs/8.2.php

https://www.youtube.com/watch?v=rqB7jRunukw

https://webdevkin.ru/posts/frontend/adminka-vue-8-vuex-practice

Димыч см ютуб калан реакл камасутра

http://falbar.ru/article/kak-ispolzovat-routing-v-vue-dlya-sozdaniya-xoroshego-polzovatelskogo-interfejsa

https://www.youtube.com/watch?v=Xd_rxScxRWs

.split(' ').join('-')
split осуществляет разбиение строки в массив по указанному разделителю.
 join объединяет элементы массива в строку с указанным разделителем (он будет вставлен между элементами массива</p>
  
  тз https://www.notion.so/Junior-Frontend-developer-aeeb4eac55634e11a855ae294fbe4404

  посмотреть bim проекты как выносить роуты на компоненты
  <!--Добавление нового файла или страницы   -->
  <!-- 1. пишем название (sort,json) в массив test в leftsidebar vue -->
  <!-- 2. создаем сам файл sort.vue в папке views в нужной папке категории и создаем разметку в нем -->
  <!-- 3. папка router => index.js => пишем в routers путь,имя и импортируем файл компонент (sort,json) -->
  
  научиться передавать события и общаться через компоненты между собой
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>