<template>
  <div>
    <h2 class="template-title-component">API</h2>

    <div class="template-discription-component">
      API (программный интерфейс приложения, интерфейс прикладного программирования)
       (англ. application programming interface, API) — описание способов
       (набор классов, процедур, функций, структур или констант), которыми одна
        компьютерная программа может взаимодействовать с другой программой. <br><br> Обычно
         входит в описание какого-либо интернет-протокола, программного каркаса (фреймворка)
          или стандарта вызовов функций операционной системы). 
          Часто реализуется отдельной программной библиотекой или сервисом операционной 
          системы. Используется программистами при написании всевозможных приложений.
    </div>

      <div class="template-code-component-wrapper">
        <code class="template-style-code">
      API как средство интеграции приложений <br><br>
      API определяет функциональность, которую предоставляет программа (модуль, библиотека), при этом API позволяет абстрагироваться от того, как именно эта функциональность реализована.<br><br>

      Если программу (модуль, библиотеку) рассматривать как чёрный ящик, то API — это множество «ручек», которые доступны пользователю данного ящика и которые он может вертеть и дёргать.<br><br>

      Программные компоненты взаимодействуют друг с другом посредством API. При этом обычно компоненты образуют иерархию — высокоуровневые компоненты используют API низкоуровневых компонентов, а те, в свою очередь, используют API ещё более низкоуровневых компонентов.<br><br>

      По такому принципу построены протоколы передачи данных по Интернету. Стандартный стек протоколов (сетевая модель OSI) содержит 7 уровней (от физического уровня передачи бит до уровня протоколов приложений, подобных протоколам HTTP и IMAP). Каждый уровень пользуется
       функциональностью предыдущего («нижележащего») уровня передачи данных и, в свою очередь, предоставляет нужную функциональность следующему («вышележащему») уровню.<br><br>

      Понятие протокола близко по смыслу к понятию API. И то, и другое является абстракцией функциональности, только в первом случае речь идёт о передаче данных, а во втором — о взаимодействии приложений.<br><br>

      API библиотеки функций и классов включает в себя описание сигнатур и семантики функций.
        </code>
      </div>

<br><br>






      <a href="https://ru.wikipedia.org/wiki/API"
       class="template-link-supporting-information" target="_blank">Ссылка на википедию API</a>

      <a href="https://habr.com/ru/post/464261/"
       class="template-link-supporting-information" target="_blank">Ссылка на Что такое API простыми словами</a>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>