<template>
  <div>arrow function
function sum(a,b) {
  return a+b
}


    const area = (a,b) => {

    }
    доступна функция после ее обьявления

    должно быть имя переменной обязательно для стрелочной

    почитать получше про нее и видео добавить + полезные примеры и ссылки


    область видимости функций

    блочная,внутри функции и внешне(глобальная)

замыкания нужно подучить!

асинхронные операции нужно подучить!

калл бекс тоже подучить


  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>