

<template>
  <div>
      forEach - просто перебирает массив , ничего не возвращает и не может вернуть кроме undefined

map - возвращает новый массив
так же перебирает но возвращает новый массив с результатом

метод includes - позволяет проверить, содержится ли значение внутри искомого массива, возвращает тру или фолс

метод find - находит определенный эл по определенному условию в массиве , тоже цикл
const res = arr.find( (item) => {
return item.id === 1
})
возвращает элемент(один)
возвращает всего один раз если тру и прекрощает действие
findIndex - возвращает индекс элемента

filter - фильтрует массив по определенному условию

push - добавляет элементы в конец массив

split создает массив из строки 
разделитель принимает
const str = 'Lern js'
const arr = str.split(разделитель-первый аргумент,)
str.split('-',)

join - помогает преобразовать массив в строку, обратный метод split
arrStr.join('') - разделитель ''

splice - для удаления или вставки эл внутрь массиваы, изменяет массив
arr.splice(index-elementa prinimaet - 1-й аргумент, кол-во элементов что удаляем, значение которое хотим вставить в массив)

flat- для двухмерных и более массивов - извлекает из глубоких массивов -  значения
arr = [1,2[2,3[3,4]]]
3-кол-во вложенных массивов если знаем их кол-во
если не знаем кол-во , передаем инфинити
arr.flat(3)
arr.flat(инфинити)
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>