<template>
  <div>
       <h2 class="template-title-component">Мок. Моковые данные.</h2>

       <div class="template-discription-component">Mock-объект (от англ. mock object, буквально: «объект-пародия», «объект-имитация», а также «подставка») — в объектно-ориентированном программировании — тип объектов, реализующих заданные аспекты моделируемого программного окружения. <br><br>

Mock-объект представляет собой конкретную фиктивную реализацию интерфейса, предназначенную исключительно для тестирования взаимодействия и относительно которого высказывается утверждение.<br><br>

В процедурном программировании аналогичная конструкция называется «dummy» (англ. — заглушка). Функция, выдающая константу, или случайную величину из допустимого диапазона значений. <br><br>

Mock-объекты активно используются в разработке через тестирование.
        </div>


  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>