<template>
  <div>regular expressions

    рег вырожения - это способ записи текстовых шаблонов, по сути это обычная строка, но на спец языке
    
    к ней относятся общиее правила

    const opn = new RegExp('pattern');
    const opn2 = /pattern/;

    рег вырожения сложная тема

    /abc/ идущие подряд
    /[abc]/ один из символов
    /[^abc]/ ни один из символов
    /[a-z]/ Диапозон символов от а до з маленькие
    /\b/ граница слова (первый или последний символ b)
    /\B/ не граница слова
    /\d/ Цифра
    /\D/ не Цифра


/\w/ лат буква, цифра или _
/\W/ не лат буква, цифра и _
/\s/ пробельный символ
/\S/ не пробельный символ
/a{3}/ 3 символа подряд
/a{2,4}/ от 2 о 4 символов а
/a+/ 1 и более символ
/a*/ 0 и более символов
/a?/ 0 или 1 символ
/./ один любой символ

g - global ищет все соответсвия,а не только первое

i поиск игнорирующий регистр

m - многострочный текстовых

онлайн редактор регул вырожений
https://regex101.com/


  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>