<template>
  <div>
    <h2 class="template-title-component">Рендер, Рендеринг страницы</h2>

    <div class="template-discription-component">
      Рендер (Рендеринг) — это процесс создания финального изображения или
      последовательности из изображений на основе двухмерных или трехмерных
      данных. Данный процесс происходит с использованием компьютерных программ и
      зачастую сопровождается трудными техническими вычислениями, которые
      ложатся на вычислительные мощности компьютера или на отдельные его
      комплектующие части.
    </div>

    <div class="template-discription-component">
      Рендеринг (rendering) -- "визуализация". В общем смысле под рендиренгом
      подразумевается перевод объектов не имеющих визуального представления
      (структуры в памяти компьютера) в объекты это представление имеющие (отчет
      в формате html или pdf). <br />
      "Редериться" могут: <br />
      html страницы (данные оборачиваются в html и отдаются пользователю) <br />
      видео-сцены (например заставки в компьютерных играх) <br />
      изображения после применения фильтров (вывод его на экран, после того, как
      математические функции вычислили новый цвет каждого пискселя по закону
      данного фильтра)
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style>
</style>