<template>
  <div>
      Сетевое взаимодействие

      Клиент => Сервер

      сервер - удаленный комп который умеет получать и обрабатывать запросы и выдавать информацию.

      у сервера есть свой url (google.com) , ip адрес 192.168.0.1 

      DNS - Система доменных имен, преобразует url в ip адрес

      протоколы запроса http, https на сервер

      типы запроса GET, POST, DELETE, PUT  (Получить, отправить, удалить, изменить)

      AJAX - для  работы с сервером без перезагрузки стр, запрос 

      fetch - новый вариант ajax запроса


  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>